# City population by sex, city and city type

http://unstats.un.org/

The United Nations Statistics Division collects, compiles and disseminates official demographic and social statistics on a wide range of topics. Data have been collected since 1948 through a set of questionnaires dispatched annually to over 230 national statistical offices and have been published in the Demographic Yearbook collection. The Demographic Yearbook disseminates statistics on population size and composition, births, deaths, marriage and divorce, as well as respective rates, on an annual basis. The Demographic Yearbook census datasets cover a wide range of additional topics including economic activity, educational attainment, household characteristics, housing characteristics, ethnicity, language, foreign-born and foreign population. The available Population and Housing Censuses' datasets reported to UNSD for the censuses conducted worldwide since 1995, are now available in UNdata.

This latest update includes several datasets on international travel and migration inflows and outflows, and on incoming and departing international migrants by several characteristics, as reported by the national authorities to the UN Statistics Division for the reference years 2010 to the present as available.

# Import Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from pathlib import Path
import warnings

# Options and Settings

In [2]:
%matplotlib inline
plt.style.use('ggplot')
plt.rcParams['figure.autolayout'] = True
plt.rcParams['font.size'] = 12
path = Path.cwd()                                          # get current working directory
warnings.simplefilter('ignore')

# Import Data

In [3]:
df = pd.read_csv('City population by sex, city and city type.csv')

# Head and Tail

In [4]:
df = df[:65586]                                   # select index position 0-65586. index position > 65586 contains footnotes
df

,Country or Area,Year,Area,Sex,City,City type,Record Type,Reliability,Source Year,Value,Value Footnotes
0,Åland Islands,2020,Total,Both Sexes,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2021.0,11692.0,1
1,Åland Islands,2020,Total,Male,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2021.0,5599.5,1
2,Åland Islands,2020,Total,Female,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2021.0,6092.0,1
3,Åland Islands,2019,Total,Both Sexes,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2020.0,11711.0,1
4,Åland Islands,2019,Total,Male,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2020.0,5606.0,1
...,...,...,...,...,...,...,...,...,...,...,...
65581,Zimbabwe,1992,Total,Male,Mutare,City proper,Census - de facto - complete tabulation,"Final figure, complete",1992.0,68413.0,NaN
65582,Zimbabwe,1992,Total,Female,Bulawayo,City proper,Census - de facto - complete tabulation,"Final figure, complete",1992.0,311878.0,NaN
65583,Zimbabwe,1992,Total,Female,Chitungwiza,City proper,Census - de facto - complete tabulation,"Final figure, complete",1992.0,137022.0,NaN
65584,Zimbabwe,1992,Total,Female,Gweru,City proper,Census - de facto - complete tabulation,"Final figure, complete",1992.0,63565.0,NaN
65585,Zimbabwe,1992,Total,Female,HARARE,City proper,Census - de facto - complete tabulation,"Final figure, complete",1992.0,565758.0,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65586 entries, 0 to 65585
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country or Area  65586 non-null  object
 1   Year             65586 non-null  object
 2   Area             65586 non-null  object
 3   Sex              65586 non-null  object
 4   City             65586 non-null  object
 5   City type        65586 non-null  object
 6   Record Type      65586 non-null  object
 7   Reliability      65586 non-null  object
 8   Source Year      65586 non-null  float64
 9   Value            65586 non-null  float64
 10  Value Footnotes  32770 non-null  object
dtypes: float64(2), object(9)
memory usage: 5.5+ MB

In [6]:
df.rename(columns={'Country or Area': 'country_or_area', 
                   'City type': 'city_type', 
                   'Record Type': 'record_type',
                   'Value': 'population'}, inplace=True)                    

df.columns = [col.lower() for col in df.columns]
df.head()

,country_or_area,year,area,sex,city,city_type,record_type,reliability,source year,population,value footnotes
0,Åland Islands,2020,Total,Both Sexes,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2021.0,11692.0,1
1,Åland Islands,2020,Total,Male,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2021.0,5599.5,1
2,Åland Islands,2020,Total,Female,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2021.0,6092.0,1
3,Åland Islands,2019,Total,Both Sexes,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2020.0,11711.0,1
4,Åland Islands,2019,Total,Male,MARIEHAMN,City proper,Estimate - de jure,"Final figure, complete",2020.0,5606.0,1

In [7]:
cols = ['country_or_area', 'year', 'sex', 'city', 'city_type', 'population']
df_sub = df[cols]
df_sub

      country_or_area  year         sex         city    city_type  population
0       Åland Islands  2020  Both Sexes    MARIEHAMN  City proper     11692.0
1       Åland Islands  2020        Male    MARIEHAMN  City proper      5599.5
2       Åland Islands  2020      Female    MARIEHAMN  City proper      6092.0
3       Åland Islands  2019  Both Sexes    MARIEHAMN  City proper     11711.0
4       Åland Islands  2019        Male    MARIEHAMN  City proper      5606.0
...               ...   ...         ...          ...          ...         ...
65581        Zimbabwe  1992        Male       Mutare  City proper     68413.0
65582        Zimbabwe  1992      Female     Bulawayo  City proper    311878.0
65583        Zimbabwe  1992      Female  Chitungwiza  City proper    137022.0
65584        Zimbabwe  1992      Female        Gweru  City proper     63565.0
65585        Zimbabwe  1992      Female       HARARE  City proper    565758.0

[65586 rows x 6 columns]

In [8]:
df_sub.describe(include='object')

           country_or_area   year         sex      city    city_type
count                65586  65586       65586     65586        65586
unique                 216     47           3      4769            2
top     Russian Federation   2010  Both Sexes  Hamilton  City proper
freq                  5059   8231       24664       155        50332

In [9]:
df_sub['country_or_area'].value_counts()

Russian Federation          5059
Japan                       4422
United States of America    3938
India                       3501
Canada                      3203
                            ...
Lesotho                        1
Comoros                        1
Chad                           1
Central African Republic       1
Barbados                       1
Name: country_or_area, Length: 216, dtype: int64

In [10]:
df_sub['year'].value_counts()

2010    8231
2011    6052
2000    4838
2001    3737
2016    3287
2015    3249
2009    3193
2007    3048
2006    2963
2012    2911
2005    2879
2008    2753
2018    2675
2017    2405
2004    2210
2003    1909
2019    1809
2013    1744
2014    1709
2020    1403
2021     594
1999     592
2002     427
1998     215
1991     213
1992     133
1996     130
1995      46
1993      41
1988      38
1987      30
2012      15
1992      14
2002      12
1997      11
1990      11
1983       9
1976       9
2010       9
1984       6
1994       6
1970       5
1986       4
1985       4
1989       3
1980       3
1981       1
Name: year, dtype: int64

In [11]:
df_sub['sex'].value_counts()

Both Sexes    24664
Male          20462
Female        20460
Name: sex, dtype: int64

In [12]:
df_sub['city'].value_counts()

Hamilton              155
Maribor               114
LJUBLJANA             114
Novi Sad              102
BEOGRAD (BELGRADE)    102
                     ...
Ugep                    1
Umuahia                 1
ST. JOHN                1
Warri                   1
Ikot Ekpene             1
Name: city, Length: 4769, dtype: int64

In [13]:
df_sub['city_type'].value_counts()

City proper            50332
Urban agglomeration    15254
Name: city_type, dtype: int64

# Descriptive Statistics

In [14]:
min_pop = np.round(df_sub['population'].min(), 2)
mean_pop = np.round(df_sub['population'].mean(), 2)
max_pop = np.round(df_sub['population'].max(), 2)

# country or area with a city population of 0 indicates indicates inhabitable areas and should not be considered in further analysis
print('Minimum, mean and maximum population are {:,}, {:,} and {:,} respectively'.format(min_pop, mean_pop, max_pop))

df_sub.describe()

Minimum, mean and maximum population are 0.0, 305,578.39 and 23,019,196.0 respectively

         population
count  6.558600e+04
mean   3.055784e+05
std    7.307785e+05
min    0.000000e+00
25%    8.002675e+04
50%    1.346330e+05
75%    2.662578e+05
max    2.301920e+07

# City Population By Sex

In [15]:
df_sub1 = df_sub[df_sub['population'] >= 1000]                   # filter country or area with population not less than 1000 
df_sub1

      country_or_area  year         sex         city    city_type  population
0       Åland Islands  2020  Both Sexes    MARIEHAMN  City proper     11692.0
1       Åland Islands  2020        Male    MARIEHAMN  City proper      5599.5
2       Åland Islands  2020      Female    MARIEHAMN  City proper      6092.0
3       Åland Islands  2019  Both Sexes    MARIEHAMN  City proper     11711.0
4       Åland Islands  2019        Male    MARIEHAMN  City proper      5606.0
...               ...   ...         ...          ...          ...         ...
65581        Zimbabwe  1992        Male       Mutare  City proper     68413.0
65582        Zimbabwe  1992      Female     Bulawayo  City proper    311878.0
65583        Zimbabwe  1992      Female  Chitungwiza  City proper    137022.0
65584        Zimbabwe  1992      Female        Gweru  City proper     63565.0
65585        Zimbabwe  1992      Female       HARARE  City proper    565758.0

[65477 rows x 6 columns]

# Discretization and quantiling

In [16]:
df_sub1.describe()

         population
count  6.547700e+04
mean   3.060867e+05
std    7.312802e+05
min    1.009000e+03
25%    8.032400e+04
50%    1.348850e+05
75%    2.668180e+05
max    2.301920e+07

In [17]:
df_sub1['pop_cat'] = pd.cut(df_sub1['population'], [1.0e3, 8.03e4, 2.67e5, np.inf], labels=['low', 'medium', 'high'])
df_sub1

,country_or_area,year,sex,city,city_type,population,pop_cat
0,Åland Islands,2020,Both Sexes,MARIEHAMN,City proper,11692.0,low
1,Åland Islands,2020,Male,MARIEHAMN,City proper,5599.5,low
2,Åland Islands,2020,Female,MARIEHAMN,City proper,6092.0,low
3,Åland Islands,2019,Both Sexes,MARIEHAMN,City proper,11711.0,low
4,Åland Islands,2019,Male,MARIEHAMN,City proper,5606.0,low
...,...,...,...,...,...,...,...
65581,Zimbabwe,1992,Male,Mutare,City proper,68413.0,low
65582,Zimbabwe,1992,Female,Bulawayo,City proper,311878.0,high
65583,Zimbabwe,1992,Female,Chitungwiza,City proper,137022.0,medium
65584,Zimbabwe,1992,Female,Gweru,City proper,63565.0,low
65585,Zimbabwe,1992,Female,HARARE,City proper,565758.0,high

In [18]:
df_sub1.describe(exclude='number')

           country_or_area   year         sex      city    city_type pop_cat
count                65477  65477       65477     65477        65477   65477
unique                 211     46           3      4764            2       3
top     Russian Federation   2010  Both Sexes  Hamilton  City proper  medium
freq                  5059   8217       24607       155        50229   32766

In [19]:
df_sub1['pop_cat'].value_counts()

medium    32766
low       16361
high      16350
Name: pop_cat, dtype: int64

# Dataframe Grouping

In [20]:
cnt_area_grp = df_sub.groupby('country_or_area')
cnt_area_grp.head()

      country_or_area  year         sex         city    city_type  population
0       Åland Islands  2020  Both Sexes    MARIEHAMN  City proper     11692.0
1       Åland Islands  2020        Male    MARIEHAMN  City proper      5599.5
2       Åland Islands  2020      Female    MARIEHAMN  City proper      6092.0
3       Åland Islands  2019  Both Sexes    MARIEHAMN  City proper     11711.0
4       Åland Islands  2019        Male    MARIEHAMN  City proper      5606.0
...               ...   ...         ...          ...          ...         ...
65545        Zimbabwe  2012  Both Sexes     Bulawayo  City proper    653337.0
65546        Zimbabwe  2012  Both Sexes  Chitungwiza  City proper    356840.0
65547        Zimbabwe  2012  Both Sexes        Gweru  City proper     91806.0
65548        Zimbabwe  2012  Both Sexes       HARARE  City proper   1485231.0
65549        Zimbabwe  2012  Both Sexes       Mutare  City proper    262124.0

[965 rows x 6 columns]

In [21]:
grpd_pop_stats =  cnt_area_grp.agg(
    min_pop = pd.NamedAgg('population', 'min'), 
    max_pop = pd.NamedAgg('population', 'max'),
    tot_pop = pd.NamedAgg('population', 'sum')
)

grpd_pop_stats

                            min_pop    max_pop     tot_pop
country_or_area
Albania                     56511.0   418495.0   1849214.0
Algeria                    102151.0  2712944.0  30798425.0
American Samoa               2086.0     4278.0     12212.0
Andorra                     10543.0    24779.0    377476.0
Anguilla                     2812.0     4904.0      7716.0
...                             ...        ...         ...
Wallis and Futuna Islands    1126.0     1191.0      3454.0
Yemen                      103312.0  1747934.0   6828794.0
Zambia                      68763.0  1747152.0   8561982.0
Zimbabwe                    45239.0  1485231.0  15173456.0
Åland Islands                4943.0    11711.0    339160.5

[216 rows x 3 columns]

In [22]:
grpd_pop_stats['tot_pop'].sort_values(ascending=False).head(10)      # top 10 cities with the highest city population

country_or_area
Mexico                      1.684642e+09
Russian Federation          1.433414e+09
China                       1.262169e+09
United States of America    1.238266e+09
Canada                      1.177859e+09
India                       1.119160e+09
Australia                   1.021318e+09
Japan                       1.017797e+09
Republic of Korea           7.114409e+08
Spain                       5.410185e+08
Name: tot_pop, dtype: float64

In [23]:
cnt_area_grp.get_group('Mexico')

,country_or_area,year,sex,city,city_type,population
36563,Mexico,2021,Both Sexes,Acapulco,Urban agglomeration,852622.0
36564,Mexico,2021,Both Sexes,Acayucan,Urban agglomeration,114416.0
36565,Mexico,2021,Both Sexes,Aguascalientes,Urban agglomeration,1140916.0
36566,Mexico,2021,Both Sexes,Apatzingán de la Constitución,Urban agglomeration,102362.0
36567,Mexico,2021,Both Sexes,Cabo San Lucas,Urban agglomeration,202694.0
...,...,...,...,...,...,...
39244,Mexico,2005,Female,Veracruz,Urban agglomeration,319121.0
39245,Mexico,2005,Female,Villahermosa,City proper,175121.0
39246,Mexico,2005,Female,Villahermosa,Urban agglomeration,191414.0
39247,Mexico,2005,Female,Zacatecas-Guadalupe,City proper,64434.0
39248,Mexico,2005,Female,Zacatecas-Guadalupe,Urban agglomeration,115846.0

In [24]:
cnt_area_grp.get_group('Russian Federation')

,country_or_area,year,sex,city,city_type,population
46673,Russian Federation,2012,Both Sexes,Abakan,City proper,168655.0
46674,Russian Federation,2012,Both Sexes,Achinsk,City proper,107943.0
46675,Russian Federation,2012,Both Sexes,Achinsk,Urban agglomeration,109229.0
46676,Russian Federation,2012,Both Sexes,Almetievsk,City proper,148384.0
46677,Russian Federation,2012,Both Sexes,Anapa,Urban agglomeration,156928.0
...,...,...,...,...,...,...
51727,Russian Federation,2004,Female,Yuzhno-Sakhalinsk,City proper,92583.0
51728,Russian Federation,2004,Female,Zelenodolsk,City proper,54960.0
51729,Russian Federation,2004,Female,Zheleznodorozhny,City proper,63191.0
51730,Russian Federation,2004,Female,Zhukovsky,City proper,55017.0
51731,Russian Federation,2004,Female,Zlatoust,City proper,104230.0

In [25]:
cnt_area_grp.get_group('China')

,country_or_area,year,sex,city,city_type,population
11016,China,2010,Both Sexes,BEIJING (PEKING),Urban agglomeration,19612368.0
11017,China,2010,Both Sexes,Shanghai,Urban agglomeration,23019196.0
11018,China,2010,Male,BEIJING (PEKING),Urban agglomeration,10126430.0
11019,China,2010,Male,Shanghai,Urban agglomeration,11854916.0
11020,China,2010,Female,BEIJING (PEKING),Urban agglomeration,9485938.0
...,...,...,...,...,...,...
12985,China,2000,Female,Zixing,City proper,169949.0
12986,China,2000,Female,Ziyang,City proper,488708.0
12987,China,2000,Female,Zoucheng,City proper,529242.0
12988,China,2000,Female,Zunhua,City proper,335541.0
12989,China,2000,Female,Zunyi,City proper,332855.0

In [26]:
cnt_area_grp.get_group('United States of America')

,country_or_area,year,sex,city,city_type,population
60928,United States of America,2016,Both Sexes,Abilene (TX),City proper,122225.0
60929,United States of America,2016,Both Sexes,Akron (OH),City proper,197633.0
60930,United States of America,2016,Both Sexes,Albuquerque (NM),City proper,559277.0
60931,United States of America,2016,Both Sexes,Alexandria (VA),City proper,155810.0
60932,United States of America,2016,Both Sexes,Allentown (PA),City proper,120443.0
...,...,...,...,...,...,...
64861,United States of America,2000,Female,Winston-Salem (NC),City proper,98431.0
64862,United States of America,2000,Female,Winston-Salem (NC),Urban agglomeration,156542.0
64863,United States of America,2000,Female,Worcester (MA),City proper,89734.0
64864,United States of America,2000,Female,Worcester (MA),Urban agglomeration,222073.0
64865,United States of America,2000,Female,Yonkers (NY),City proper,103954.0

In [27]:
cnt_area_grp.get_group('Canada')

,country_or_area,year,sex,city,city_type,population
6166,Canada,2020,Both Sexes,Abbotsford,City proper,161581.0
6167,Canada,2020,Both Sexes,Abbotsford-Mission,Urban agglomeration,204265.0
6168,Canada,2020,Both Sexes,Ajax,City proper,132251.0
6169,Canada,2020,Both Sexes,Barrie,City proper,153411.0
6170,Canada,2020,Both Sexes,Barrie,Urban agglomeration,218188.0
...,...,...,...,...,...,...
9364,Canada,2001,Female,Vaughan,City proper,91605.0
9365,Canada,2001,Female,Windsor,City proper,106480.0
9366,Canada,2001,Female,Windsor,Urban agglomeration,156380.0
9367,Canada,2001,Female,Winnipeg,City proper,320125.0
9368,Canada,2001,Female,Winnipeg,Urban agglomeration,345400.0

In [28]:
cnt_area_grp.get_group('India')

,country_or_area,year,sex,city,city_type,population
21071,India,2011,Both Sexes,Abohar,Urban agglomeration,145302.0
21072,India,2011,Both Sexes,Achalpur,Urban agglomeration,112311.0
21073,India,2011,Both Sexes,Adilabad,Urban agglomeration,117167.0
21074,India,2011,Both Sexes,Adityapur,Urban agglomeration,174355.0
21075,India,2011,Both Sexes,Adoni,Urban agglomeration,184625.0
...,...,...,...,...,...,...
24567,India,2001,Female,Yamunanagar,Urban agglomeration,140603.0
24568,India,2001,Female,Yavatmal,City proper,58896.0
24569,India,2001,Female,Yavatmal,Urban agglomeration,67927.0
24570,India,2001,Female,Gangapur City,Urban agglomeration,49387.0
24571,India,2001,Female,Tezpur,Urban agglomeration,45508.0

In [29]:
cnt_area_grp.get_group('Australia')

,country_or_area,year,sex,city,city_type,population
866,Australia,2019,Both Sexes,Adelaide,City proper,25456.0
867,Australia,2019,Both Sexes,Adelaide,Urban agglomeration,1340794.0
868,Australia,2019,Both Sexes,Ballarat,City proper,109505.0
869,Australia,2019,Both Sexes,Bendigo,City proper,118093.0
870,Australia,2019,Both Sexes,Brisbane,City proper,1253982.0
...,...,...,...,...,...,...
2274,Australia,2001,Female,Sydney,Urban agglomeration,1753177.0
2275,Australia,2001,Female,Toowoomba,City proper,7256.0
2276,Australia,2001,Female,Toowoomba,Urban agglomeration,48022.0
2277,Australia,2001,Female,Townsville,City proper,934.0
2278,Australia,2001,Female,Townsville,Urban agglomeration,59044.0

In [30]:
cnt_area_grp.get_group('Japan')

,country_or_area,year,sex,city,city_type,population
28813,Japan,2015,Both Sexes,Abiko,City proper,131606.0
28814,Japan,2015,Both Sexes,Ageo,City proper,225196.0
28815,Japan,2015,Both Sexes,Aizuwakamatsu,City proper,124062.0
28816,Japan,2015,Both Sexes,Akashi,City proper,293409.0
28817,Japan,2015,Both Sexes,Akishima,City proper,111539.0
...,...,...,...,...,...,...
33230,Japan,2000,Female,Yatsushiro,City proper,56392.0
33231,Japan,2000,Female,Yokkaichi,City proper,147670.0
33232,Japan,2000,Female,Yokohama,City proper,1691259.0
33233,Japan,2000,Female,Yokosuka,City proper,212957.0
33234,Japan,2000,Female,Yonago,City proper,72636.0

In [31]:
cnt_area_grp.get_group('Republic of Korea')

,country_or_area,year,sex,city,city_type,population
45142,Republic of Korea,2019,Both Sexes,Busan (Pusan),City proper,3372763.0
45143,Republic of Korea,2019,Both Sexes,Daegu (Taegu),City proper,2432442.0
45144,Republic of Korea,2019,Both Sexes,Daejeon (Taejon),City proper,1508753.0
45145,Republic of Korea,2019,Both Sexes,Gwangju (Kwangchu),City proper,1493571.0
45146,Republic of Korea,2019,Both Sexes,Incheon,City proper,2943992.0
...,...,...,...,...,...,...
45623,Republic of Korea,2000,Female,Wonju,City proper,133451.0
45624,Republic of Korea,2000,Female,Yangsan,City proper,95424.0
45625,Republic of Korea,2000,Female,Yeongcheon,City proper,56216.0
45626,Republic of Korea,2000,Female,Yeongju,City proper,62951.0
45627,Republic of Korea,2000,Female,Yeosu,City proper,150397.0

In [32]:
cnt_area_grp.get_group('Spain')

,country_or_area,year,sex,city,city_type,population
53779,Spain,2019,Both Sexes,Albacete,City proper,173832.0
53780,Spain,2019,Both Sexes,Alcalá de Henares,City proper,196605.0
53781,Spain,2019,Both Sexes,Alcobendas,City proper,117728.0
53782,Spain,2019,Both Sexes,Alcorcón,City proper,171449.0
53783,Spain,2019,Both Sexes,Algeciras,City proper,122517.0
...,...,...,...,...,...,...
56382,Spain,2001,Female,Vitoria-Gasteiz,City proper,111232.0
56383,Spain,2001,Female,Vitoria-Gasteiz,Urban agglomeration,114026.0
56384,Spain,2001,Female,Zaragoza,City proper,318671.0
56385,Spain,2001,Female,Zaragoza,City proper,308370.0
56386,Spain,2001,Female,Zaragoza,Urban agglomeration,349991.0

In [33]:
grpd_pop_stats['tot_pop'].sort_values(ascending=True).head(10)        # top 10 cities with the lowest city population

country_or_area
Nauru                                672.0
Pitcairn                            1111.0
Montserrat                          1478.0
Niue                                2474.0
Holy See                            2813.0
Wallis and Futuna Islands           3454.0
British Virgin Islands              3500.0
Saint Helena ex. dep.               5760.0
Micronesia (Federated States of)    6227.0
Barbados                            7466.0
Name: tot_pop, dtype: float64

In [34]:
cnt_area_grp.get_group('Nauru').head()

      country_or_area  year         sex   city    city_type  population
39519           Nauru  1992  Both Sexes  YAREN  City proper       672.0

In [35]:
cnt_area_grp.get_group('Pitcairn').head()

      country_or_area  year         sex       city    city_type  population
42860        Pitcairn  2013  Both Sexes  ADAMSTOWN  City proper        49.0
42861        Pitcairn  2013        Male  ADAMSTOWN  City proper        23.0
42862        Pitcairn  2013      Female  ADAMSTOWN  City proper        26.0
42863        Pitcairn  2012  Both Sexes  ADAMSTOWN  City proper        48.0
42864        Pitcairn  2012        Male  ADAMSTOWN  City proper        22.0

In [36]:
cnt_area_grp.get_group('Montserrat')

      country_or_area  year         sex      city    city_type  population
39449      Montserrat  1980  Both Sexes  PLYMOUTH  City proper      1478.0

In [37]:
cnt_area_grp.get_group('Niue')

      country_or_area  year         sex   city    city_type  population
41311            Niue  2011  Both Sexes  ALOFI  City proper       639.0
41312            Niue  2011        Male  ALOFI  City proper       311.0
41313            Niue  2011      Female  ALOFI  City proper       328.0
41314            Niue  2006  Both Sexes  ALOFI  City proper       581.0
41315            Niue  2001  Both Sexes  ALOFI  City proper       615.0

In [38]:
cnt_area_grp.get_group('Holy See')

      country_or_area  year         sex          city    city_type  population
20082        Holy See  2012  Both Sexes  VATICAN CITY  City proper       451.0
20083        Holy See  2000  Both Sexes  VATICAN CITY  City proper       798.0
20084        Holy See  2000        Male  VATICAN CITY  City proper       529.0
20085        Holy See  2000      Female  VATICAN CITY  City proper       269.0
20086        Holy See  1988  Both Sexes  VATICAN CITY  City proper       766.0

In [39]:
cnt_area_grp.get_group('Wallis and Futuna Islands')

,country_or_area,year,sex,city,city_type,population
65502,Wallis and Futuna Islands,2008,Both Sexes,META-UTU,City proper,1126.0
65503,Wallis and Futuna Islands,2003,Both Sexes,META-UTU,City proper,1191.0
65504,Wallis and Futuna Islands,1996,Both Sexes,META-UTU,City proper,1137.0

In [40]:
cnt_area_grp.get_group('British Virgin Islands')

,country_or_area,year,sex,city,city_type,population
5663,British Virgin Islands,1992,Both Sexes,ROAD TOWN,City proper,3500.0

In [41]:
cnt_area_grp.get_group('Saint Helena ex. dep.').head()

,country_or_area,year,sex,city,city_type,population
51743,Saint Helena ex. dep.,2021,Both Sexes,JAMESTOWN,City proper,625.0
51744,Saint Helena ex. dep.,2021,Male,JAMESTOWN,City proper,318.0
51745,Saint Helena ex. dep.,2021,Female,JAMESTOWN,City proper,307.0
51746,Saint Helena ex. dep.,2016,Both Sexes,JAMESTOWN,City proper,657.0
51747,Saint Helena ex. dep.,2016,Male,JAMESTOWN,City proper,341.0

In [42]:
cnt_area_grp.get_group('Micronesia (Federated States of)')

,country_or_area,year,sex,city,city_type,population
39249,Micronesia (Federated States of),2000,Both Sexes,PALIKIR,City proper,6227.0

In [43]:
cnt_area_grp.get_group('Barbados')

     country_or_area  year         sex        city    city_type  population
2932        Barbados  1980  Both Sexes  BRIDGETOWN  City proper      7466.0